MarlinFirmware/Marlin/buildroot/share/PlatformIO/variants/MARLIN_MKS_SKIPR_V1/variant.h
// I2C Definitions
#define PIN_WIRE_SCL            PB8
#define PIN_WIRE_SDA            PB9

// Timer Definitions
// Do not use timer used by PWM pins when possible. See PinMap_PWM in PeripheralPins.c
// TIM1 = HEATER0, HEATER1, [SERVO]
// TIM2 = FAN1, FAN2, [BEEPER]
// TIM4 = HEATER_BED
// TIM5 = HEATER2, FAN0
// Uses default for STM32F4xx STEP_TIMER 6 and TEMP_TIMER 14
#define TIMER_SERVO             TIM1  // TIMER_SERVO must be defined in this file
#define TIMER_TONE              TIM2  // TIMER_TONE must be defined in this file
#define TIMER_SERIAL            TIM3  // TIMER_SERIAL must be defined in this file

// USART1 (direct to RK3328 SoC)
#define ENABLE_HWSERIAL1
#define PIN_SERIAL1_TX           PA9
#define PIN_SERIAL1_RX          PA10

// USART3 connector
#define ENABLE_HWSERIAL3
#define PIN_SERIAL3_TX          PB10
#define PIN_SERIAL3_RX          PB11

#ifdef __cplusplus
} // extern "C"
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR         Serial1
#define SERIAL_PORT_USBVIRTUAL      SerialUSB
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE1       Serial3
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial3
#endif
